package org.libra.ui.flash.components {
	import org.libra.ui.Constants;
	import org.libra.ui.flash.core.Component;
	/**
	 * <p>
	 * Description
	 * </p>
	 *
	 * @class JHGroup
	 * @author 鸿杰
	 * @qq 32968210
	 * @date 12/03/2013
	 * @version 1.0
	 * @see
	 */
	public class JHGroup extends JGroup {
		
		public function JHGroup(x:int = 0, y:int = 0, gap:int = 5) {
			super(x, y, gap, Constants.HORIZONTAL);
		}
		
		/*-----------------------------------------------------------------------------------------
		Public methods
		-------------------------------------------------------------------------------------------*/
		
		/*-----------------------------------------------------------------------------------------
		Private methods
		-------------------------------------------------------------------------------------------*/
		
		/*-----------------------------------------------------------------------------------------
		Event Handlers
		-------------------------------------------------------------------------------------------*/
		
	}

}